Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotPasteNoWorkplane Property
 Can't paste because there is no corresponding Work Plane. Set workplane or switch to view with appropriate workplane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPasteNoWorkplane { get; }
Visual Basic
Public Shared ReadOnly Property CannotPasteNoWorkplane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPasteNoWorkplane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace